# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/Laxminarayen/Inceptz-Batch13-Analytics_and_Python/master/08%20-%20Day%20-%208%20-%20Python%20Quiz%20Session/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [51]:
baby_names = pd.read_csv("https://raw.githubusercontent.com/Laxminarayen/Inceptz-Batch13-Analytics_and_Python/master/08%20-%20Day%20-%208%20-%20Python%20Quiz%20Session/06_Stats/US_Baby_Names/US_Baby_Names_right.csv")
baby_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   Unnamed: 0  1016395 non-null  int64
 1   Id          1016395 non-null  int64
 2   Name        1016395 non-null  object
 3   Year        1016395 non-null  int64
 4   Gender      1016395 non-null  object
 5   State       1016395 non-null  object
 6   Count       1016395 non-null  int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

### Step 4. See the first 10 entries

In [3]:
baby_names.head(10)
#what can be predicted or how can this dataset be used?
#1. predict Count 
#2. Statewise infant gender ratio

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [8]:
baby_names.drop() #Functions will have open and close braces

ValueError: Need to specify at least one of 'labels', 'index' or 'columns'

In [ ]:
and 
as
def
continue 
else
if
for
break

In [4]:
del baby_names['Unnamed: 0'] #Keyword based operation

In [5]:
baby_names.head()

      Id     Name  Year Gender State  Count
0  11350     Emma  2004      F    AK     62
1  11351  Madison  2004      F    AK     48
2  11352   Hannah  2004      F    AK     46
3  11353    Grace  2004      F    AK     44
4  11354    Emily  2004      F    AK     41

In [6]:
del baby_names['Id']

In [7]:
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [9]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [12]:
del baby_names['Year'] 
names = baby_names.groupby('Name').sum()
names.sort_values("Count",ascending=False)

             Count
Name
Jacob       242874
Emma        214852
Michael     214405
Ethan       209277
Isabella    204798
...            ...
Eniola           5
Atlantis         5
Marci            5
Simarpreet       5
Nita             5

[17632 rows x 1 columns]

### Step 8. How many different names exist in the dataset?

In [13]:
len(names)

17632

In [17]:
baby_names['Name'].nunique()

17632

### Step 9. What is the name with most occurrences?

In [18]:
names.loc[names.Count == names.Count.max()]

        Count
Name
Jacob  242874

In [19]:
names['Count'].idxmax()

'Jacob'

### Step 10. How many different names have the least occurrences?

In [20]:
len(names.loc[names.Count == names.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [50]:
names

         Count
Name
Aaban       12
Aadan       23
Aadarsh      5
Aaden     3426
Aadhav       6
...        ...
Zyra        42
Zyrah       11
Zyren        6
Zyria       59
Zyriah      58

[17632 rows x 1 columns]

In [28]:
#[] - inside the braces we are giving the filtering criteria
names.loc[names['Count'] == names['Count'].median()]

         Count
Name
Aishani     49
Alara       49
Alysse      49
Ameir       49
Anely       49
...        ...
Sriram      49
Trinton     49
Vita        49
Yoni        49
Zuleima     49

[66 rows x 1 columns]

### Step 12. What is the standard deviation of names?

In [29]:
names.Count.std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [32]:
names.describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000

### Step 14. What is the name with second most occurrences?

In [33]:
nlargest() / nsmallest()

NameError: name 'nlargest' is not defined

In [48]:
names.loc[names['Count'] == names.Count.nlargest(2).iloc[-1]]

       Count
Name
Emma  214852

In [55]:
import numpy as np
np.random.rand(254,830)*254

array([[196.755399  ,  47.82365727, 197.14143108, ..., 201.49177199,
         70.97819137,  28.3302425 ],
       [ 26.714089  , 208.74210599, 219.42502545, ...,  81.02189564,
         21.65605585, 232.93337559],
       [246.39773871, 201.69846366,  68.16917357, ..., 241.97554567,
        226.07268658, 194.26837239],
       ...,
       [138.99319023, 135.73457522, 207.48516039, ...,  42.79705221,
        113.3356783 , 115.09435351],
       [ 18.86094342,  82.90848455,  23.15656616, ..., 190.98550434,
         81.76266664,  74.57189785],
       [200.30115425, 204.26561045,  45.42035168, ..., 197.50629829,
        150.96553102,  94.28925773]])

In [73]:
import numpy as np
df_float = pd.DataFrame(np.random.rand(25)*20)
#df_float.columns = ['Some_decimal']

In [75]:
df_float.columns = ['Some_decimal']

RangeIndex(start=0, stop=1, step=1)

In [71]:
pd.set_option('display.precision',12)

In [72]:
df_float

       Some_decimal
0    9.442171168602
1    4.525293054551
2   10.371472050250
3    4.946203626799
4   15.033060397399
5    8.125517352382
6   17.199391644789
7    4.685530801951
8   14.161291802619
9   19.103268292753
10   5.954926130982
11  16.554008672312
12  19.883211879771
13   8.202351283639
14   6.640960378452
15  14.558807628140
16   8.233267811574
17  12.138953423619
18  11.115832092466
19  16.252403184719
20  18.470935790249
21   8.639863871838
22  14.930548324360
23   4.074219128608
24  19.019409278700

In [ ]:
import numpy as np
df_float = pd.DataFrame(np.random.rand(25)*20)
df_float.columns = ['Some_decimal']

In [65]:
df_float.round(2)

    Some_decimal
0           8.82
1           0.77
2          13.12
3           0.20
4           7.98
5          18.71
6          10.56
7          12.47
8           4.85
9          18.66
10         19.43
11         17.97
12          2.60
13          7.94
14         11.65
15          2.77
16          1.39
17         10.31
18          9.36
19         10.52
20          2.57
21          8.40
22          1.98
23         19.09
24          3.98